#+TITLE: Alex Scott's Emacs configuration
#+OPTIONS: toc:4 h:4
#+STARTUP: showeverything
#+PROPERTY: header-args:emacs-lisp    :tangle yes :results silent :exports code


****  Org capture url                                                  :exwm:
 https://elmord.org/blog/?entry=20180214-exwm-org-capture
   #+begin_src emacs-lisp

 (defun elmord-exwm-get-firefox-url ()
   (exwm-input--fake-key ?\C-l)
   (sleep-for 0.05)                      ; Wait a bit for the browser to respond.
   (exwm-input--fake-key ?\C-c)
   (sleep-for 0.05)
   (gui-backend-get-selection 'CLIPBOARD 'STRING))


 (defun elmord-exwm-org-store-link ()
   (when (and (equal major-mode 'exwm-mode)
              (member exwm-class-name '("Firefox")))
     (org-store-link-props
      :type "http"
      :link (elmord-exwm-get-firefox-url)
      :description exwm-title)))


;; (org-link-set-parameters "firefox" :store 'elmord-exwm-org-store-link)

   #+end_src


   #+RESULTS:
   | :store | elmord-exwm-org-store-link |

